<template>
  <q-page padding class="book-content q-mt-lg">
    <div class="print-hide">
      <q-page-sticky position="top-right">
        <controls-plug v-model="options" :minimizeO="true"> </controls-plug>
      </q-page-sticky>
    </div>
      <transliterate :text="text" src="Devanagari" :tgt="options.script" :sourcePreserve="options.sourcePreserve" :postOptions="options.postOptions">
      </transliterate>
      <span class = "demo"></span>
  </q-page>
</template>

<style scoped>
  .demo {
      font-family: Ariel;
  }
</style>

<script>
import Transliterate from '../components/Transliterate'
import ControlsPlug from '../components/ControlsPlug'
import {QPageSticky, QInnerLoading, QSpinnerComment} from 'quasar'

export default {
  components: {
    ControlsPlug,
    QPageSticky,
    Transliterate,
    QInnerLoading,
    QSpinnerComment
  },
  data () {
    return {
      options: {script: 'IAST', sourcePreserve: false},
      text: '. . .',
      name: this.$route.params.text,
      loading: true,
      texts: {
        'triratnanusmriti': `<h5>आर्यत्रिरत्नानुस्मृतिसूत्रम् </h5>
<div>
(ख) संस्कृतपाठः

भारतीयभाषायाम्-आर्यत्रिरत्नानुस्मृतिसूत्रम्

भोटभाषायाम्-फग्स्-पा-दकोन्-म्च्छोग्-ग्सुम्-जेस्-सु-ड्रन्-पा-म्दो

नमः सर्वबुद्धबोधिसत्त्वेभ्यः

(बुद्धानुस्मृतिः)

इत्यपि बुद्धो भगवांस्तथागतोऽर्हन् सम्यक्संबुद्धो विद्याचरणसम्पन्नः सुगतो लोकविदनुत्तरः पुरुषदम्यसारथिः शास्ता देवमनुष्याणां बुद्धो भगवानिति।

निष्यन्दः स तथागतः पुण्यानाम्, अविप्रणाशः कुशलमूलानाम्, अलङ्कृतः क्षान्त्या, आलयः पुण्यनिधानानाम्, चित्रितोऽनुव्यञ्जनैः कुसुमितो लक्षणैः, प्रतिरूपो गोचरेण, अप्रतिकूलो दर्शनेन, अभिरतिः श्रद्धा(शुद्धा)धिमुक्तानाम्, अनभिभूतः प्रज्ञया, अनवमर्दनीयो बलैः, शास्ता सर्वसत्त्वानाम्, पिता बोधिसत्त्वानाम्, राजा आर्यपुद्गलानाम्, सार्थवाहः निर्वाणनगरसम्प्रस्थितानाम्, अप्रमेयो ज्ञानेन, अचिन्त्यः प्रतिभानेन, विशुद्धः स्वरेण, आस्वदनीयो घोषेण, असेचनको रूपेण, अप्रतिसमः कायेन, अलिप्तः कामैः, अनुपलिप्तो रूपैः असंसृष्ट आरूप्यैः, विप्रमुक्तः स्कन्धेभ्यः, विसम्प्रयुक्तो धातुभिः, संवृत आयतनैः, प्रच्छिन्नो ग्रन्थैः, विमुक्तः परिदाघ्नैः, परिमुक्तस्तृष्णया, ओघादुत्तीर्णः परिपूर्णो ज्ञानेन, प्रतिष्ठितोऽतीतानागतप्रत्युत्पन्नानां बुद्धानां भगवतां ज्ञाने, अप्रतिष्ठितो निर्वाणे, स्थितो भूतकोट्याम्, स्थितः सर्वसत्त्वालोकनीयायां भूमौ, सर्व इमे तथागतानां विशेषतः सम्यग् गुणाः।

(धर्मानुस्मृतिः)

सद्धर्मस्तु आदौ कल्याणः, मध्ये कल्याणः, पर्यवसाने कल्याणः, स्वर्थः सुव्यञ्जनः, केवलः, परिपूर्णः, परिशुद्धः, पर्यवदातः, स्वाख्यातः भगवतो धर्मः, सान्दृष्टिकः, निर्ज्वरः, आकालिकः, औपनायिकः, ऐहिपश्यिकः, प्रत्यात्मवेदनीयो विज्ञैः, स्वाख्यातो भगवतो धर्मविनयः सुप्रवेदितः नैर्याणिकः, संबोधिगामी, अभिन्नः संस्तूपः, सप्रतिशरणः, छिन्नप्लोतिकः।

(संघानुस्मृतिः)

सुप्रतिपन्नो भगवत आर्यसंघः, न्यायप्रतिपन्नः, ऋजुप्रतिपन्नः, सामीचीप्रतिपन्नः, अञ्जलीकरणीयः, सामीचीकरणीयः, पुण्यश्रीक्षेत्रः, महादक्षिणापरिशोधकः, प्राहवनीयः, आहवनीयः।

॥ आर्यत्रिरत्नानुस्मृतिसूत्रं समाप्तम्॥
</div>

<hr/>
Text extracted from <a href='http://www.dsbcproject.org/canon-text/book/411'> DSBC </a>`,
        'khuddakapatha': `॥ नमो तस्स भगवतो अरहतो सम्मासम्बुद्धस्स ॥
<div>
<i> खुद्दकनिकाये </i>
<h5> खुद्दकपाठपाळि </h5>

<b> १. सरणत्तयं </b>

बुद्धं सरणं गच्छामि।
धम्मं सरणं गच्छामि।
सङ्घं सरणं गच्छामि॥

दुतियम्पि बुद्धं सरणं गच्छामि।
दुतियम्पि धम्मं सरणं गच्छामि।
दुतियम्पि सङ्घं सरणं गच्छामि॥

ततियम्पि बुद्धं सरणं गच्छामि।
ततियम्पि धम्मं सरणं गच्छामि।
ततियम्पि सङ्घं सरणं गच्छामि॥

सरणत्तयं निट्ठितं।

<b> २. दससिक्खापदं </b>

१. पाणातिपाता वेरमणी-सिक्खापदं समादियामि।

२. अदिन्‍नादाना वेरमणी-सिक्खापदं समादियामि।

३. अब्रह्मचरिया वेरमणी-सिक्खापदं समादियामि।

४. मुसावादा वेरमणी-सिक्खापदं समादियामि।

५. सुरामेरयमज्‍जपमादट्ठाना वेरमणी-सिक्खापदं समादियामि।

६. विकालभोजना वेरमणी-सिक्खापदं समादियामि।

७. नच्‍च-गीत-वादित-विसूकदस्सना वेरमणी-सिक्खापदं समादियामि।

८. माला-गन्ध-विलेपन-धारण-मण्डन-विभूसनट्ठाना वेरमणी-सिक्खापदं समादियामि।

९. उच्‍चासयन-महासयना वेरमणी-सिक्खापदं समादियामि।

१०. जातरूप-रजतपटिग्गहणा वेरमणी-सिक्खापदं समादियामि।

दससिक्खापदं निट्ठितं।

<b> ३. द्वत्तिंसाकारो </b>

अत्थि इमस्मिं काये –

केसा लोमा नखा दन्ता तचो,
मंसं न्हारु अट्ठि अट्ठिमिञ्‍जं वक्‍कं,
हदयं यकनं किलोमकं पिहकं पप्फासं,
अन्तं अन्तगुणं उदरियं करीसं मत्थलुङ्गं,
पित्तं सेम्हं पुब्बो लोहितं सेदो मेदो,
अस्सु वसा खेळो सिङ्घाणिका लसिका मुत्तन्ति ॥
द्वत्तिंसाकारो निट्ठितो।

<b> ४. कुमारपञ्हा </b>

१. ‘‘एकं नाम किं’’? ‘‘सब्बे सत्ता आहारट्ठितिका’’।

२. ‘‘द्वे नाम किं’’? ‘‘नामञ्‍च रूपञ्‍च’’।

३. ‘‘तीणि नाम किं’’? ‘‘तिस्सो वेदना’’।

४. ‘‘चत्तारि नाम किं’’? ‘‘चत्तारि अरियसच्‍चानि’’।

५. ‘‘पञ्‍च नाम किं’’? ‘‘पञ्‍चुपादानक्खन्धा’’।

६. ‘‘छ नाम किं’’? ‘‘छ अज्झत्तिकानि आयतनानि’’।

७. ‘‘सत्त नाम किं’’? ‘‘सत्त बोज्झङ्गा’’।

८. ‘‘अट्ठ नाम किं’’? ‘‘अरियो अट्ठङ्गिको मग्गो’’।

९. ‘‘नव नाम किं’’? ‘‘नव सत्तावासा’’।

१०. ‘‘दस नाम किं’’? ‘‘दसहङ्गेहि समन्‍नागतो ‘अरहा’ति वुच्‍चती’’ति।

कुमारपञ्हा निट्ठिता।

<b> ५. मङ्गलसुत्तं </b>

१. एवं मे सुतं – एकं समयं भगवा सावत्थियं विहरति जेतवने अनाथपिण्डिकस्स आरामे। अथ खो अञ्‍ञतरा देवता अभिक्‍कन्ताय रत्तिया अभिक्‍कन्तवण्णा केवलकप्पं जेतवनं ओभासेत्वा येन भगवा तेनुपसङ्कमि; उपसङ्कमित्वा भगवन्तं अभिवादेत्वा एकमन्तं अट्ठासि। एकमन्तं ठिता खो सा देवता भगवन्तं गाथाय अज्झभासि –

२. ‘‘बहू देवा मनुस्सा च, मङ्गलानि अचिन्तयुं।
आकङ्खमाना सोत्थानं, ब्रूहि मङ्गलमुत्तमं’’॥

३. ‘‘असेवना च बालानं, पण्डितानञ्‍च सेवना।
पूजा च पूजनेय्यानं , एतं मङ्गलमुत्तमं॥

४. ‘‘पतिरूपदेसवासो च, पुब्बे च कतपुञ्‍ञता।
अत्तसम्मापणिधि च, एतं मङ्गलमुत्तमं॥

५. ‘‘बाहुसच्‍चञ्‍च सिप्पञ्‍च, विनयो च सुसिक्खितो।
सुभासिता च या वाचा, एतं मङ्गलमुत्तमं॥

६. ‘‘मातापितु उपट्ठानं, पुत्तदारस्स सङ्गहो।
अनाकुला च कम्मन्ता, एतं मङ्गलमुत्तमं॥

७. ‘‘दानञ्‍च धम्मचरिया च, ञातकानञ्‍च सङ्गहो।
अनवज्‍जानि कम्मानि, एतं मङ्गलमुत्तमं॥

८. ‘‘आरती विरती पापा, मज्‍जपाना च संयमो।
अप्पमादो च धम्मेसु, एतं मङ्गलमुत्तमं॥

९. ‘‘गारवो च निवातो च, सन्तुट्ठि च कतञ्‍ञुता।
कालेन धम्मस्सवनं, एतं मङ्गलमुत्तमं॥

१०. ‘‘खन्ती च सोवचस्सता, समणानञ्‍च दस्सनं।
कालेन धम्मसाकच्छा, एतं मङ्गलमुत्तमं॥

११. ‘‘तपो च ब्रह्मचरियञ्‍च, अरियसच्‍चान दस्सनं।
निब्बानसच्छिकिरिया च, एतं मङ्गलमुत्तमं॥

१२. ‘‘फुट्ठस्स लोकधम्मेहि, चित्तं यस्स न कम्पति।
असोकं विरजं खेमं, एतं मङ्गलमुत्तमं॥

१३. ‘‘एतादिसानि कत्वान, सब्बत्थमपराजिता।
सब्बत्थ सोत्थिं गच्छन्ति, तं तेसं मङ्गलमुत्तम’’न्ति॥

मङ्गलसुत्तं निट्ठितं।

<b>६. रतनसुत्तं </b>

१. यानीध भूतानि समागतानि, भुम्मानि वा यानि व अन्तलिक्खे।
सब्बेव भूता सुमना भवन्तु, अथोपि सक्‍कच्‍च सुणन्तु भासितं॥

२. तस्मा हि भूता निसामेथ सब्बे, मेत्तं करोथ मानुसिया पजाय।
दिवा च रत्तो च हरन्ति ये बलिं, तस्मा हि ने रक्खथ अप्पमत्ता॥

३. यं किञ्‍चि वित्तं इध वा हुरं वा, सग्गेसु वा यं रतनं पणीतं।
न नो समं अत्थि तथागतेन, इदम्पि बुद्धे रतनं पणीतं।
एतेन सच्‍चेन सुवत्थि होतु॥

४. खयं विरागं अमतं पणीतं, यदज्झगा सक्यमुनी समाहितो।
न तेन धम्मेन समत्थि किञ्‍चि, इदम्पि धम्मे रतनं पणीतं।
एतेन सच्‍चेन सुवत्थि होतु॥

५. यं बुद्धसेट्ठो परिवण्णयी सुचिं, समाधिमानन्तरिकञ्‍ञमाहु।
समाधिना तेन समो न विज्‍जति, इदम्पि धम्मे रतनं पणीतं।
एतेन सच्‍चेन सुवत्थि होतु॥

६. ये पुग्गला अट्ठ सतं पसत्था, चत्तारि एतानि युगानि होन्ति।
ते दक्खिणेय्या सुगतस्स सावका, एतेसु दिन्‍नानि महप्फलानि।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

७. ये सुप्पयुत्ता मनसा दळ्हेन, निक्‍कामिनो गोतमसासनम्हि।
ते पत्तिपत्ता अमतं विगय्ह, लद्धा मुधा निब्बुतिं भुञ्‍जमाना।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

८. यथिन्दखीलो पथविस्सितो सिया, चतुब्भि वातेहि असम्पकम्पियो।
तथूपमं सप्पुरिसं वदामि, यो अरियसच्‍चानि अवेच्‍च पस्सति।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

९. ये अरियसच्‍चानि विभावयन्ति, गम्भीरपञ्‍ञेन सुदेसितानि।
किञ्‍चापि ते होन्ति भुसं पमत्ता, न ते भवं अट्ठममादियन्ति।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

१०. सहावस्स दस्सनसम्पदाय , तयस्सु धम्मा जहिता भवन्ति।
सक्‍कायदिट्ठी विचिकिच्छितञ्‍च, सीलब्बतं वापि यदत्थि किञ्‍चि॥

११. चतूहपायेहि च विप्पमुत्तो, छच्‍चाभिठानानि।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

१२. किञ्‍चापि सो कम्म करोति पापकं, कायेन वाचा उद चेतसा वा।
अभब्ब , अभब्बता दिट्ठपदस्स वुत्ता।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

१३.वनप्पगुम्बे यथ गिम्हे।
तथूपमं धम्मवरं अदेसयि , निब्बानगामिं परमं हिताय।
इदम्पि बुद्धे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

१४. वरो वरञ्‍ञू वरदो वराहरो, अनुत्तरो धम्मवरं अदेसयि।
इदम्पि बुद्धे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

१५. खीणं पुराणं नव नत्थि सम्भवं, विरत्तचित्तायतिके भवस्मिं।
ते खीणबीजा अविरूळ्हिछन्दा, निब्बन्ति धीरा यथायं पदीपो।
इदम्पि सङ्घे रतनं पणीतं, एतेन सच्‍चेन सुवत्थि होतु॥

१६. यानीध भूतानि समागतानि, भुम्मानि वा यानि व अन्तलिक्खे।
तथागतं देवमनुस्सपूजितं, बुद्धं नमस्साम सुवत्थि होतु॥

१७. यानीध भूतानि समागतानि, भुम्मानि वा यानि व अन्तलिक्खे।
तथागतं देवमनुस्सपूजितं, धम्मं नमस्साम सुवत्थि होतु॥

१८. यानीध भूतानि समागतानि, भुम्मानि वा यानि व अन्तलिक्खे।
तथागतं देवमनुस्सपूजितं, सङ्घं नमस्साम सुवत्थि होतूति॥
रतनसुत्तं निट्ठितं।

<b> ७. तिरोकुट्टसुत्तं </b>

१. तिरोकुट्टेसु तिट्ठन्ति, सन्धिसिङ्घाटकेसु च।
द्वारबाहासु तिट्ठन्ति, आगन्त्वान सकं घरं॥

२. पहूते अन्‍नपानम्हि, खज्‍जभोज्‍जे उपट्ठिते।
न तेसं कोचि सरति, सत्तानं कम्मपच्‍चया॥

३. एवं ददन्ति ञातीनं, ये होन्ति अनुकम्पका।
सुचिं पणीतं कालेन, कप्पियं पानभोजनं।
इदं वो ञातीनं होतु, सुखिता होन्तु ञातयो॥

४. ते च तत्थ समागन्त्वा, ञातिपेता समागता।
पहूते अन्‍नपानम्हि, सक्‍कच्‍चं अनुमोदरे॥

५. चिरं जीवन्तु नो ञाती, येसं हेतु लभामसे।
अम्हाकञ्‍च कता पूजा, दायका च अनिप्फला॥

६. न हि तत्थ कसि अत्थि, गोरक्खेत्थ न विज्‍जति।
वणिज्‍जा तादिसी नत्थि, हिरञ्‍ञेन कयोकयं।
इतो दिन्‍नेन यापेन्ति, पेता कालङ्कता तहिं॥

७. उन्‍नमे उदकं वुट्ठं, यथा निन्‍नं पवत्तति।
एवमेव इतो दिन्‍नं, पेतानं उपकप्पति॥

८. यथा वारिवहा पूरा, परिपूरेन्ति सागरं।
एवमेव इतो दिन्‍नं, पेतानं उपकप्पति॥

९. अदासि मे अकासि मे, ञातिमित्ता सखा च मे।
पेतानं दक्खिणं दज्‍जा, पुब्बे कतमनुस्सरं॥

१०. न हि रुण्णं वा सोको वा, या चञ्‍ञा परिदेवना।
न तं पेतानमत्थाय, एवं तिट्ठन्ति ञातयो॥

११. अयञ्‍च खो दक्खिणा दिन्‍ना, सङ्घम्हि सुप्पतिट्ठिता।
दीघरत्तं हितायस्स, ठानसो उपकप्पति॥

१२. सो ञातिधम्मो च अयं निदस्सितो, पेतान पूजा च कता उळारा।
बलञ्‍च भिक्खूनमनुप्पदिन्‍नं , तुम्हेहि पुञ्‍ञं पसुतं अनप्पकन्ति॥

तिरोकुट्टसुत्तं निट्ठितं।

<b>८. निधिकण्डसुत्तं </b>

१. निधिं निधेति पुरिसो, गम्भीरे ओदकन्तिके।
अत्थे किच्‍चे समुप्पन्‍ने, अत्थाय मे भविस्सति॥

२. राजतो वा दुरुत्तस्स, चोरतो पीळितस्स वा।
इणस्स वा पमोक्खाय, दुब्भिक्खे आपदासु वा।
एतदत्थाय लोकस्मिं, निधि नाम निधीयति॥

३. तावस्सुनिहितो सन्तो, गम्भीरे ओदकन्तिके।
न सब्बो सब्बदा एव, तस्स तं उपकप्पति॥

४. निधि वा ठाना चवति, सञ्‍ञा वास्स विमुय्हति।
नागा वा अपनामेन्ति, यक्खा वापि हरन्ति नं॥

५. अप्पिया वापि दायादा, उद्धरन्ति अपस्सतो।
यदा पुञ्‍ञक्खयो होति, सब्बमेतं विनस्सति॥

६. यस्स दानेन सीलेन, संयमेन दमेन च।
निधी सुनिहितो होति, इत्थिया पुरिसस्स वा॥

७. चेतियम्हि च सङ्घे वा, पुग्गले अतिथीसु वा।
मातरि पितरि चापि , अथो जेट्ठम्हि भातरि॥

८. एसो निधि सुनिहितो, अजेय्यो अनुगामिको।
पहाय गमनीयेसु, एतं आदाय गच्छति॥

९. असाधारणमञ्‍ञेसं, अचोराहरणो निधि।
कयिराथ धीरो पुञ्‍ञानि, यो निधि अनुगामिको॥

१०. एस देवमनुस्सानं, सब्बकामददो निधि।
यं यदेवाभिपत्थेन्ति, सब्बमेतेन लब्भति॥

११. सुवण्णता सुसरता, सुसण्ठाना सुरूपता।
आधिपच्‍चपरिवारो, सब्बमेतेन लब्भति॥

१२. पदेसरज्‍जं इस्सरियं, चक्‍कवत्तिसुखं पियं।
देवरज्‍जम्पि दिब्बेसु, सब्बमेतेन लब्भति॥

१३. मानुस्सिका च सम्पत्ति, देवलोके च या रति।
या च निब्बानसम्पत्ति, सब्बमेतेन लब्भति॥

१४. मित्तसम्पदमागम्म, योनिसोव पयुञ्‍जतो।
विज्‍जा विमुत्ति वसीभावो, सब्बमेतेन लब्भति॥

१५. पटिसम्भिदा विमोक्खा च, या च सावकपारमी।
पच्‍चेकबोधि बुद्धभूमि, सब्बमेतेन लब्भति॥

१६. एवं महत्थिका एसा, यदिदं पुञ्‍ञसम्पदा।
तस्मा धीरा पसंसन्ति, पण्डिता कतपुञ्‍ञतन्ति॥

निधिकण्डसुत्तं निट्ठितं।

<b> ९. मेत्तसुत्तं </b>

१. करणीयमत्थकुसलेन, यन्तसन्तं पदं अभिसमेच्‍च।
सक्‍को उजू च सुहुजू च, सुवचो चस्स मुदु अनतिमानी॥

२. सन्तुस्सको च सुभरो च, अप्पकिच्‍चो च सल्‍लहुकवुत्ति।
सन्तिन्द्रियो च निपको च, अप्पगब्भो कुलेस्वननुगिद्धो॥

३. न च खुद्दमाचरे किञ्‍चि, येन विञ्‍ञू परे उपवदेय्युं।
सुखिनोव खेमिनो होन्तु, सब्बसत्ता भवन्तु सुखितत्ता॥

४. ये केचि पाणभूतत्थि, तसा वा थावरा वनवसेसा।
दीघा वा येव महन्ता , मज्झिमा रस्सका अणुकथूला॥

५. दिट्ठा वा येव अदिट्ठा दूरे वसन्ति अविदूरे।
भूता व , सब्बसत्ता भवन्तु सुखितत्ता॥

६. न परो परं निकुब्बेथ, नातिमञ्‍ञेथ कत्थचि न कञ्‍चि।
ब्यारोसना पटिघसञ्‍ञा, नाञ्‍ञमञ्‍ञस्स दुक्खमिच्छेय्य॥

७. माता यथा नियं पुत्तमायुसा एकपुत्तमनुरक्खे।
एवम्पि सब्बभूतेसु, मानसं भावये अपरिमाणं॥

८. मेत्तञ्‍च सब्बलोकस्मि, मानसं भावये अपरिमाणं।
उद्धं अधो च तिरियञ्‍च, असम्बाधं अवेरमसपत्तं॥

९. तिट्ठं चरं निसिन्‍नो व, सयानो यावतास्स वितमिद्धो।
एतं सतिं अधिट्ठेय्य, ब्रह्ममेतं विहारमिधमाहु॥

१०. दिट्ठिञ्‍च अनुपग्गम्म, सीलवा दस्सनेन सम्पन्‍नो।
कामेसु विनय गेधं, न हि जातुग्गब्भसेय्य पुन रेतीति॥

मेत्तसुत्तं निट्ठितं।

खुद्दकपाठपाळि निट्ठिता।
</div>

<hr/>
Text extracted from <a href="https://tipitaka.org/ios/deva/mula/suttapitaka/khuddakanikaya/khuddakapathapali.html"> Tipitaka.org </a>`,
        'dhammachakka': `<h5>धम्मचक्कप्पवत्तन सुत्तं</h5>
<div>
नमो तस्स भगवतो अरहतो सम्मा सम्बुद्धस्स

एवं मे सुतं, एकं समयं भगवा बाराणसियं विहरति इसिपतने मिगदाये तत्र खो भगवा पञ्चवग्गिये भिक्खू आमन्तेसि: "द्वे मे भिक्खवे, अन्ता पब्बजितेन न सेवितब्बा। योचयां कामेसु कामसुखल्लिकानुयोगो हीनो गम्मो पोथुज्जनिको अनरियो अनत्थसंहितो, यो चायं अत्तकिलमथानुयोगो दुक्खो अनरियो अनत्थसंहितो, एते ते भिक्खवे, उभो अन्ते अनुपगम्म मज्झिमा पटिपदा तथागतेन अभिसम्बुद्धा चक्खुकरणी ञाणकरणी उपसमाय अभिञ्ञाय सम्बोधाय निब्बानाय संवत्तति। कतमा च सा भिक्खवे, मज्झिमा पटिपदा तथागतेन अभिसम्बुद्धा चक्खुकरणी ञाणकरणी उपसमाय अभिञ्ञाय सम्बोधाय निब्बानाय संवत्तति: अयमेव अरियो अट्ठङ्गिको मग्गो सेय्यथीदं: सम्मादिट्ठि सम्मासङ्कप्पो सम्मावाचा सम्माकम्मन्तो सम्माआजीवो सम्मावायामो सम्मासति सम्मासमाधि। अयं खो सा भिक्खवे, मज्झिमा पटिपदा तथागतेन अभिसम्बुद्धा चक्खुकरणी ञाणकरणी उपसमाय अभिञ्ञाय सम्बोधाय निब्बानाय संवत्तति।

इदं खो पन भिक्खवे, दुक्खं अरियसच्चं: जातिपि दुक्खा जरापि दुक्खा व्याधिपि दुक्खो मरणम्पि दुक्खं अप्पियेहि सम्पयोगो दुक्खो पियेहि विप्पयोगो दुक्खो यम्पिच्छं न लभति तम्पि दुक्खं सङ्खित्तेन पञ्चुपादानक्खन्धा दुक्खा"। इदं खो पन भिक्खवे, दुक्खसमुदयो अरियसच्चं: "यायं तण्हा पोनोभविका नन्दिरागसहगता तत्र तत्राभिनन्दिनी, सेय्यथीदं: कामतण्हा भवतण्हा विभवतण्हा"। इदं खो पन भिक्खवे, दुक्खनिरोधो अरियसच्चं: यो तस्सायेव तण्हाय असेसविरागनिरोधो चागो पटिनिस्सग्गो मुत्ति अनालयो। इदं खो पन भिक्खवे, दुक्खनिरोधगामिनी पटिपदा अरियसच्चं: अयमेव अरियो अट्ठङ्गिको मग्गो, सेय्यथीदं: सम्मादिट्ठि सम्मासङ्कप्पो सम्मावाचा सम्माकम्मन्तो सम्माआजीवो सम्मावायामो सम्मासति सम्मासमाधि।

"इदं दुक्खं अरियसच्चन्ति" मे भिक्खवे पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खं अरियसच्चं परिञ्ञेय्यन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खं अरियसच्चं परिञ्ञातन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि।

"इदं दुक्खसमुदयो अरियसच्चन्ति" मे भिक्खवे पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खसमुदयो अरियसच्चं पहातब्बन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खसमुदयो अरियसच्चं पहीनन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि।

"इदं दुक्खनिरोधो अरियसच्चन्ति" मे भिक्खवे पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खनिरोधो अरियसच्चं सच्छिकातब्बन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खनिरोधो अरियसच्चं सच्छिकतन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि।

"इदं दुक्खनिरोधगामिनी पटिपदा अरियसच्चन्ति" मे भिक्खवे पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खनिरोधगामिनी पटिपदा अरियसच्चं भावेतब्बन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि। तं खो पनिदं दुक्खनिरोधगामिनी पटिपदा अरियसच्चं भावितन्ति मे भिक्खवे, पुब्बे अननुस्सुतेसु धम्मेसु चक्खुं उदपादि ञाणं उदपादि पञ्ञा उदपादि विज्जा उदपादि आलोको उदपादि।

यावकीवञ्च मे भिक्खवे, इमेसु चतुसु अरियसच्चेसु एवं तिपरिवट्टं द्वादसाकारं यथाभूतं ञाणदस्सनं न सुविसुद्धं अहोसि, नेव तावाहं भिक्खवे, सदेवके लोके समारके सब्रह्मके सस्समणब्राह्मणिया पजाय सदेवमनुस्साय अनुत्तरं सम्मासम्बोधिं अभिसम्बुद्धो पच्चञ्ञासिं। यतो च खो मे भिक्खवे, इमेसु चतुसु अरियसच्चेसु एवं तिपरिवट्टं द्वादसाकारं यथाभूतं ञाणदस्सनं सुविसुद्धं अहोसि, अथाहं भिक्खवे, सदेवके लोके समारके सब्रह्मके सस्समणब्राह्मणिया पजाय सदेवमनुस्साय अनुत्तरं सम्मासम्बोधिं अभिसम्बुद्धो पच्चञ्ञासिं। ञाणञ्च पन मे दस्सनं उदपादि अकुप्पा मे चेतोविमुत्ति, अयमन्तिमा जाति नत्थिदानि पुनब्भवोति। इदमवोच भगवा अत्तमना पञ्चवग्गिया भिक्खू भगवतो भासितं अभिनन्दुन्ति।
</div>
<hr/>
Text extracted from <a href="https://www.accesstoinsight.org/tipitaka/sltp/SN_V_utf8.html#pts.420"> Access to Insight</a>
`,
        'lalitavistara': `<h5>ललितविस्तरः</h5>
<div>
नमः सर्वबुद्धबोधिसत्त्वेभ्यः।

॥ ॐ नमो दशदिगनन्तापर्यन्तलोकधातुप्रतिष्ठितसर्वबुद्धबोधिसत्त्वार्यश्रावकप्रत्येकबुद्धेभ्योऽतीतानागतप्रत्युत्पन्नेभ्यः॥

<b>१० लिपिशालासंदर्शनपरिवर्तो दशमः।</b>

इति हि भिक्षवः संवृद्धः कुमारः। तदा माङ्गल्यशतसहस्रैः लिपिशालामुपनीयते स्म दशभिर्दारकसहस्रैः परिवृतः पुरस्कृतः, दशभिश्च रथसहस्रैः खादनीयभोजनीयस्वादनीयपरिपूर्णैर्हिरण्यसुवर्णपरिपूर्णैश्च। येन कपिलवस्तुनि महानगरे वीथिचत्वररथ्यान्तरापणमुखेष्वभ्यवकीर्यते स्म अभिविश्राम्यन्ते। अष्टाभिश्च तूर्यशतसहस्रैः प्रघुष्यमाणैर्महता च पुष्पवर्षेणाभिप्रवर्षता वितर्दिनिर्यूहतोरणगवाक्षहर्म्यकूटागारप्रासादतलेषु कन्याशतसहस्राणि सर्वालंकारभूषिताः स्थिता अभूवन्। बोधिसत्त्वं प्रेक्षमाणाः कुसुमानि च क्षिपन्ति स्म। अष्टौ च मरुत्कन्यासहस्राणि विगलितालंकाराभरणालंकृतानि रत्नभद्रंकरेण गृहीतानि मार्गं शोधयन्त्यो बोधिसत्त्वस्य पुरतो गच्छन्ति स्म। देवनागयक्षगन्धर्वासुरगरुडकिन्नरमहोरगाश्चार्धकायिका गगनतलात्पुष्पपट्टदामान्यभिप्रलम्बयन्ति स्म। सर्वे च शाक्यगणाः शुद्धोदनं राजानं पुरस्कृत्य बोधिसत्त्वस्य पुरतो गच्छन्ति स्म। अनेनैवंरूपेण व्यूहेन बोधिसत्त्वो लिपिशालामुपनीयते स्म॥

समनन्तरप्रवेशितश्च बोधिसत्त्वो लिपिशालाम्। अथ विश्वामित्रो नाम दारकाचार्यो बोधिसत्त्वस्य श्रियं तेजश्चासहमानो धरणितले निविष्टोऽधोमुखः प्रपतति स्म। तं तथा प्रपतितं दृष्ट्वा शुभाङ्गो नाम तुषितकायिको देवपुत्रो दक्षिणेन करतलेन परिगृह्योत्थापयति स्म। उत्थाप्य च गगनतलस्थो राजानं शुद्धोदनं तं च महान्तं जनकायं गाथाभिरभ्यभाषत्—

शास्त्राणि यानि प्रचलन्ति मनुष्यलोके
संख्या लिपिश्च गणनापि च धातुतन्त्रम्।
ये शिल्पयोग पृथु लौकिक अप्रमेयाः
तेष्वेषु शिक्षितु पुरा बहुकल्पकोट्यः॥१॥

किं तू जनस्य अनुवर्तनतां करोति
लिपिशालमागतु सुशिक्षितु शिष्यणार्थम्।
परिपाचनार्थ बहुदारक अग्रयाने
अन्यांश्च सत्त्वनयुतानमृते विनेतुम्॥२॥

लोकोत्तरेषु चतुसत्यपथे विधिज्ञो
हेतुप्रतीत्यकुशलो यथ संभवन्ति।
यथ चानिरोधक्षयु संस्थितु शीतिभावः
तस्मिन्विधिज्ञ किमथो लिपिशास्त्रमात्रे॥३॥

नेतस्य आचरिय उत्तरि वा त्रिलोके
सर्वेषु देवमनुजेष्वयमेव जेष्ठः।
नामापि तेष लिपिनां न हि वित्थ यूयं
यत्रेषु शिक्षितु पुरा बहुकल्पकोट्यः॥४॥

सो चित्तधार जगतां विविधा विचित्रा
एकक्षणेन अयु जानति शुद्धसत्त्वः।
अदृश्यरूपरहितस्य गतिं च वेत्ति
किं वा पुनोऽथ लिपिनोऽक्षरदृश्यरूपाम्॥५॥

इत्युक्त्वा स देवपुत्रो बोधिसत्त्वं दिव्यैः कुसुमैरभ्यर्च्य तत्रैवान्तर्दधे। तत्र धात्र्यश्च चेटीवर्गाश्च स्थापिता अभूवन्। परिशेषाः शाक्याः शुद्धोदनप्रमुखाः प्रक्रामन्तः॥

अथ बोधिसत्त्व उरगसारचन्दनमयं लिपिफलकमादाय दिव्यार्षसुवर्णतिरकं समन्तान्मणिरत्नप्रत्युप्तं विश्वामित्रमाचार्यमेवमाह-कतमां मे भो उपाध्याय लिपिं शिक्षापयसि। ब्राह्मीखरोष्टीपुष्करसारिं अङ्गलिपिं वङ्गलिपिं मगधलिपिं मङ्गल्यलिपिं अङ्गुलीयलिपिं शकारिलिपिं ब्रह्मवलिलिपिं पारुष्यलिपिं द्राविडलिपिं किरातलिपिं दाक्षिण्यलिपिं उग्रलिपिं संख्यालिपिं अनुलोमलिपिं अवमूर्धलिपिं दरदलिपिं खाष्यलिपिं चीनलिपिं लूनलिपिं हूणलिपिं मध्याक्षरविस्तरलिपिं पुष्पलिपिं देवलिपिं नागलिपिं यक्षलिपिं गन्धर्वलिपिं किन्नरलिपिं महोरगलिपिं असुरलिपिं गरुडलिपिं मृगचक्रलिपिं वायसरुतलिपिं भौमदेवलिपिं अन्तरीक्षदेवलिपिं उत्तरकुरुद्वीपलिपिं अपरगोडानीलिपिं पूर्वविदेहलिपिं उत्क्षेपलिपिं निक्षेपलिपिं विक्षेपलिपिं प्रक्षेपलिपिं सागरलिपिं वज्रलिपिं लेखप्रतिलेखलिपिं अनुद्रुतलिपिं शास्त्रावर्तां गणनावर्तलिपिं उत्क्षेपावर्तलिपिं निक्षेपावर्तलिपिं पादलिखितलिपिं द्विरुत्तरपदसंधिलिपिं यावद्दशोत्तरपदसंधिलिपिं मध्याहारिणीलिपिं सर्वरुतसंग्रहणीलिपिं विद्यानुलोमाविमिश्रितलिपिं ऋषितपस्तप्तां रोचमानां धरणीप्रेक्षिणीलिपिं गगनप्रेक्षिणीलिपिं सर्वौषधिनिष्यन्दां सर्वसारसंग्रहणीं सर्वभूतरुतग्रहणीम्। आसां भो उपाध्याय चतुष्षष्टीलिपीनां कतमां त्वं शिष्यापयिष्यसि?

अथ विश्वामित्रो दारकाचार्यो विस्मितः प्रहसितवदनो निहतमानमददर्प इमां गाथामभाषत—

आश्चर्यं शुद्धसत्त्वस्य लोके लोकानुवर्तिनो।
शिक्षितः सर्वशास्त्रेषु लिपिशालामुपागतः॥६॥

येषामहं नामधेयं लिपीनां न प्रजानमि।
तत्रैष शिक्षितः सन्तो लिपिशालामुपागतः॥७॥

वक्त्रं चास्य न पश्यामि मूर्धानं तस्य नैव च।
शिष्ययिष्ये कथं ह्येनं लिपिप्रज्ञाय पारगम्॥८॥

देवदेवो ह्यतिदेवः सर्वदेवोत्तमो विभुः।
असमश्च विशिष्टश्च लोकेष्वप्रतिपुद्गलः॥९॥

अस्यैव त्वनुभावेन प्रज्ञोपाये विशेषतः।
शिक्षितं शिष्ययिष्यामि सर्वलोकपरायणम्॥१०॥

इति हि भिक्षवो दश दारकसहस्राणि बोधिसत्त्वेन सार्धं लिपिं शिष्यन्ते स्म। तत्र बोधिसत्त्वाधिस्थानेन तेषां दारकाणां मातृकां वाचयतां यदा अकारं परिकीर्तयन्ति स्म, तदा अनित्यः सर्वसंस्कारशब्दो निश्चरति स्म। आकारे परिकीर्त्यमाने आत्मपरहितशब्दो निश्चरति स्म। इकारे इन्द्रियवैकल्यशब्दः। ईकारे ईतिबहुलं जगदिति। उकारे उपद्रवबहुलं जगदिति। ऊकारे ऊनसत्त्वं जगदिति। एकारे एषणासमुत्थानदोषशब्दः। ऐकारे ऐर्यापथः श्रेयानिति। ओकारे ओघोत्तरशब्दः। औकारे औपपादुकशब्दः। अंकारे अमोघोत्पत्तिशब्दः। अःकारे अस्तंगमनशब्दो निश्चरति स्म। ककारे कर्मविपाकावतारशब्दः। खकारे खसमसर्वधर्मशब्दः। गकारे गम्भीरधर्मप्रतीत्यसमुत्पादावतारशब्दः। घकारे घनपटलाविद्यामोहान्धकारविधमनशब्दः। ङकारेऽङ्गविशुद्धिशब्दः। चकारे चतुरार्यसत्यशब्दः। छकारे छन्दरागप्रहाणशब्दः। जकारे जरामरणसमतिक्रमणशब्दः। झकारे झषध्वजबलनिग्रहणशब्दः। ञकारे ज्ञापनशब्दः। टकारे पटोपच्छेदनशब्दः। ठकारे ठपनीयप्रश्नशब्दः। डकारे डमरमारनिग्रहणशब्दः। ढकारे मीढविषया इति। णकारे रेणुक्लेशा इति। तकारे तथतासंभेदशब्दः। थकारे थामबलवेगवैशारद्यशब्दः। दकारे दानदमसंयमसौरभ्यशब्दः। धकारे धनमार्याणां सप्तविधमिति। नकारे नामरूपपरिज्ञाशब्दः। पकारे परमार्थशब्दः। फकारे फलप्राप्तिसाक्षात्क्रियाशब्दः। बकारे बन्धनमोक्षशब्दः। भकारे भवविभवशब्दः। मकारे मदमानोपशमनशब्दः। यकारे यथावद्धर्मप्रतिवेधशब्दः। रकारे रत्यरतिपरमार्थरतिशब्दः। लकारे लताछेदनशब्दः। वकारे वरयानशब्दः। शकारे शमथविपश्यनाशब्दः। षकारे षडायतननिग्रहणाभिज्ञज्ञानावाप्तिशब्दः। सकारे सर्वज्ञज्ञानाभिसंबोधनशब्दः। हकारे हतक्लेशविरागशब्दः। क्षकारे परिकीर्त्यमाने क्षणपर्यन्ताभिलाप्यसर्वधर्मशब्दो निश्चरति स्म॥

इति हि भिक्षवस्तेषां दारकाणां मातृकां वाचयतां बोधिसत्त्वानुभावेनैव प्रमुखान्यसंख्येयानि धर्ममुखशतसहस्राणि निश्चरन्ति स्म॥

तदानुपूर्वेण बोधिसत्त्वेन लिपिशालास्थितेन द्वात्रिंशद्दारकसहस्राणि परिपाचितान्यभूवन्। अनुत्तरायां सम्यक्संबोधौ चित्तान्युत्पादितानि द्वात्रिंशद्दारिकासहस्राणि। अयं हेतुरयं प्रत्ययो यच्छिक्षितोऽपि बोधिसत्त्वो लिपिशालामुपागच्छति स्म॥

॥ इति श्रीललितविस्तरे लिपिशालासंदर्शनपरिवर्तो नाम दशमोऽध्यायः॥
</div>

<hr/>
Text extracted from <a href='http://www.dsbcproject.org/canon-text/content/437/2045'> DSBC </a>`,
        'panchavimsati': `<h5> पञ्चविंशतिसाहस्रिका प्रज्ञापारमिता </h5>
<!-- https://www.sanskritworld.in/public/assets/book/book_5103ff5b93eda.txt -->
<div>
[...]

पुनर् अपरं सुभूते बोधिसत्त्वस्य महासत्त्वस्य महायानं। यदुत धारणीमुखानि। यदुताक्षरनयसमताक्षरमुखमक्षरप्रवेशः। कतमोऽक्षरनयसमता अक्षरमुखमक्षरप्रवेशः।

अकारो मुखः सर्वधर्माणाम् आद्यनुत्पन्नत्वात्।
रेफो मुखः सर्वधर्माणां रजोऽपगतत्वात्।
पकारो मुखः सर्वधर्माणां परमार्थनिर्देशात्।
चकारो मुखः सर्वधर्माणां च्यवनोपपत्त्यनुपलब्धित्वात्।
नकारो मुखः सर्वधर्माणां नामापगतत्वात्।
लकारो मुखः सर्वधर्माणां लोकोत्तीर्णत्वात् तृष्णालताहेतुप्रत्ययसमुद्घातित्वात् च।
दकारो मुखः सर्वधर्माणां दान्तदमथपरिच्छिन्नत्वात्।
बकारो मुखः सर्वधर्माणां बन्धनविमुक्तत्वात्।
डकारो मुखः सर्वधर्माणां डमरापगतत्वात्।
सकारो मुखः सर्वधर्माणां सङ्गानुपलब्धित्वात्।
वकारो मुखः सर्वधर्माणां वाक्पथघोषसमुच्छिन्नत्वात्।
तकारो मुखः सर्वधर्माणां तथताऽचलितत्वात्।
यकारो मुखः सर्वधर्माणां यथावद् अनुत्पादत्वात्।
स्तकारो मुखः सर्वधर्माणां स्तम्भानुपलब्धित्वात्।
ककारो मुखः सर्वधर्माणां कारकानुपलब्धित्वात्।
सकारो मुखः सर्वधर्माणां समतानुपलब्धित्वात्।
मकारो मुखः सर्वधर्माणां ममकारानुपलब्धित्वात्।
गकारो मुखः सर्वधर्माणां गगनानुपलब्धितः।
स्थकारो मुखः सर्वधर्माणां स्थानानुपलब्धितः।
जकारो मुखः सर्वधर्माणां जात्यनुपलब्धितः।
श्वकारो मुखः सर्वधर्माणां श्वासानुपलब्धितः।
धकारो मुखः सर्वधर्माणां धर्मधात्वनुपलब्धितः।
शकारो मुखः सर्वधर्माणां शमथानुपलब्धितः।
खकारो मुखः सर्वधर्माणां खसमतानुपलब्धितः।
क्षकारो मुखः सर्वधर्माणां क्षयानुपलब्धितः।
तकारमुखाः सर्वधर्माः तच् चानुपलब्धितः।
ज्ञकारमुखाः सर्वधर्माः सर्वज्ञानानुपलब्धितः।
हकारमुखाः सर्वधर्माः हेतोर् अनुपलब्धितः।
च्छकारमुखाः सर्वधर्माः छवेर् अप्य् अनुपलब्धितः।
स्मकारमुखाः सर्वधर्माः स्मरणानुपलब्धितः।
द्धकारमुखाः सर्वधर्मा आद्धानापगतत्वात्।
सकारमुखाः सर्वधर्मा उत्साहानुपलब्धितः।
घकारमुखाः सर्वधर्माः घनानुपलब्धितः।
ठकारमुखाः सर्वधर्माः विठपनानुपलब्धितः।
णकारमुखाः सर्वधर्माः रणविगतत्वात्।
फकारमुखाः सर्वधर्माः फलानुपलब्धितः।
स्ककारमुखाः सर्वधर्माः स्कन्धानुपलब्धितः।
जकारमुखाः सर्वधर्माः जरानुपलब्धितः।
चकारमुखाः सर्वधर्माः चरणानुपलब्धितः।
टकारमुखाः सर्वधर्माः ठंकारानुपलब्धितः।
ढकारो मुखः सर्वधर्माः ढंकारानुपलब्धितः।

नास्ति अत उत्तरि अक्षयव्यवहारः। तत्कस्य हेतोः। तथा हि न कस्यचिन्नामास्ति येन संव्यवह्रियेत येन वाभिलप्येत येन निर्दिश्येत येन लक्ष्येत येन पश्येत् । तद्यथापि नाम सुभूते आकाशम्। एवमेव सर्वधर्मा अनुगन्तव्याः। अयं सुभूते धारणीप्रवेशोऽकाराद्यक्षरनिर्देशप्रवेशः। यः कश्चित् सुभूते बोधिसत्त्वो महासत्त्वः इदमकाराद्यक्षरकौशल्यप्रवेशं ज्ञास्यति न स क्वचिद्रुते प्रतिहन्यत् सर्वं तं धर्मतया समाधयिष्यति रुतज्ञानकौशल्यञ्च प्रतिलप्स्यत् यो हि कश्चित्सुभूते बोधिसत्त्वो महासत्त्व इमामकाराद्यक्षरमुद्रां श्रोष्यति श्रुत्वा चोद्ग्रहीष्यति धारयिष्यति वाचयिष्यति परेषां देशयिष्यति रमयति तया सन्तत्या तस्य विंशतिरनुशंसाः प्रतिकांक्षितव्याः। कतमा विंशतिः। स्मृतिमांश्च भविष्यति। मतिमांश्च भविष्यति। गतिमांश्च भविष्यति। धृतिमांश्च भविष्यति। ह्रीमांश्च प्रज्ञावांश्च प्रतिभानवांश्च सत्यकुशलश्च भविष्यति। इदं धारणीमुखमल्पकृच्छ्रेण प्रतिलप्स्यते न च कथंकथी भविष्यति। विमतिश्चास्य न भविष्यति। न च श्लक्ष्णां वाचं श्रुत्वा परेष्वनुनीतो भविष्यति। न च परुषया वाचा प्रतिहन्यत् न चोन्नतो भविष्यति नावनतः। यथास्थित एव भविष्यति रुतकुशलश्च भविष्यति। स्कन्धकुशलश्च भविष्यति धातुकुशलश्च भविष्यति। आयतनकुशलश्च भविष्यति सत्यकुशलश्च भविष्यति प्रतीत्यसमुत्पादकुशलश्च भविष्यति। हेतुकुशलश्च भविष्यति प्रत्ययकुशलश्च भविष्यति। धर्मकुशलश्च भविष्यति। इन्द्रियपरिपूर्णज्ञानकुशलश्च भविष्यति। परचित्तज्ञानकुशलश्च भविष्यति ऋद्धिविधिज्ञानकुशलश्च भविष्यति। दिव्यश्रोत्रज्ञानकुशलश्च भविष्यति। पूर्वनिवासानुस्मृतिज्ञानकुशलश्च भविष्यति। च्युतोपपत्तिज्ञानकुशलश्च भविष्यति। आस्रवक्षयज्ञानकुशलश्च भविष्यति। स्थानास्थाननिर्देशकुशलश्च भविष्यति। अतिक्रमणकुशलश्च भविष्यति इर्यापथकुशलश्च भविष्यति। इमाननुशंसान् प्रतिलप्स्यते इति। इदमपि सुभूते धारणीमुखमक्षरमुकमकारमुखं बोधिसत्त्वस्य महासत्त्वस्य महायानम्। इति धारणीसम्भारः॥

[...]
</div>
<hr/>
Text extracted from <a href='https://www.sanskritworld.in/public/assets/book/book_5103ff5b93eda.txt'> www.sanskritworld.in </a>
`,
        'heart': `<h5>प्रज्ञापारमिताहृदयसूत्रम्।</h5>
<div>
[संक्षिप्तमातृका]<br/>
॥ नमः सर्वज्ञाय ॥ <br/>
॥ ॐ नमो भगवत्यै आर्यप्रज्ञापारमितायै ॥ <br/>
आर्यावलोकितेश्वरबोधिसत्त्वो गम्भीरायां प्रज्ञापारमितायां चर्यां चरमाणो व्यवलोकयति स्म। पञ्च स्कन्धाः, तांश्च स्वभावशून्यान् पश्यति स्म॥<br/>
इह शारिपुत्र रूपं शून्यता, शून्यतैव रूपम्। रूपान्न पृथक् शून्यता, शून्यताया न पृथग् रूपम्। यद्रूपं सा शून्यता, या शून्यता तद्रूपम्॥<br/>
एवमेव वेदनासंज्ञासंस्कारविज्ञानानि॥<br/>
इहं शारिपुत्र सर्वधर्माः शून्यतालक्षणा अनुत्पन्ना अनिरुद्धा अमला न विमला नोना न परिपूर्णाः। तस्माच्छारिपुत्र शून्यतायां न रूपम्, न वेदना, न संज्ञा, न संस्काराः, न विज्ञानानि। न चक्षुःश्रोत्रघ्राणजिह्वाकायमनांसि, न रूपशब्दगन्धरसस्प्रष्टव्यधर्माः। न चक्षुर्धातुर्यावन्न मनोधातुः॥<br/>
न विद्या नाविद्या न विद्याक्षयो नाविद्याक्षयो यावन्न जरामरणं न जरामरणक्षयो न दुःखसमुदयनिरोधमार्गा न ज्ञानं न प्राप्तित्वम्॥<br/>
बोधिसत्त्वस्य प्रज्ञापारमितामाश्रित्य विहरति चित्तावरणः। चित्तावरणनास्तित्वादत्रस्तो विपर्यासातिक्रान्तो निष्ठनिर्वाणः। त्र्यध्वव्यवस्थिताः सर्वबुद्धाः प्रज्ञापारमितामाश्रित्य अनुत्तरां सम्यक्संबोधिमभिसंबुद्धाः॥<br/>
तस्माज्ज्ञातव्यः प्रज्ञापारमितामहामन्त्रो महाविद्यामन्त्रोऽनुत्तरमन्त्रोऽसमसममन्त्रः सर्वदुःखप्रशमनः सत्यममिथ्यत्वात् प्रज्ञापारमितायामुक्तो मन्त्रः।<br/>
तद्यथा- गते गते पारगते पारसंगते बोधि स्वाहा॥<br/>
इति प्रज्ञापारमिताहृदयसूत्रं समाप्तम्॥
</div>

<hr/>
Text extracted from <a href='http://www.dsbcproject.org/canon-text/content/401/1829'> DSBC </a>
`,
        'lotus': `<h5>सद्धर्मपुण्डरीकसूत्रम्।</h5>
<div>
॥ नमः सर्वबुद्धबोधिसत्त्वेभ्यः।

नमः सर्वतथागतप्रत्येकबुद्धार्यश्रावकेभ्योऽतीतानागतप्रत्युत्पन्नेभ्यश्च बोधिसत्त्वेभ्यः॥

<b>24 समन्तमुखपरिवर्तः॥ </b>

अथ खलु अक्षयमतिर्बोधिसत्त्वो महासत्त्व उत्थायासनादेकांसमुत्तरासङ्गं कृत्वा दक्षिणं जानुमण्डलं पृथिव्यां प्रतिष्ठाप्य येन भगवांस्तेनाञ्जलिं प्रणाम्य भगवन्तमेतदवोचत्-केन कारणेन भगवन् अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽवलोकितेश्वर इत्युच्यते? एवमुक्ते भगवानक्षयमतिं बोधिसत्त्वं महासत्त्वमेतदवोचत्-इह कुलपुत्र यावन्ति सत्त्वकोटीनयुतशतसहस्राणि यानि दुःखानि प्रत्युनुभवन्ति, तानि सचेदवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधेयं शृणुयुः, ते सर्वे तस्माद्दुःखस्कन्धाद् परिमुच्येरन्। ये च कुलपुत्र सत्त्वा अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधेयं धारयिष्यन्ति, सचेत्ते महत्यग्निस्कन्धे प्रपतेयुः, सर्वे ते अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य तेजसा तस्मान्महतोऽग्निस्कन्धात् परिमुच्येरन्। सचेत् पुनः कुलपुत्र सत्त्वा नदीभिरुह्यमाना अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्याक्रन्दं कुर्युः, सर्वास्ता नद्यस्तेषां सत्त्वानां गाधं दद्युः। सचेत् पुनः कुलपुत्र सागरमध्ये वहनाभिरूढानां सत्त्वकोटीनयुतशतसहस्राणां हिरण्यसुवर्णमणिमुक्तावज्रवैडूर्यशङ्खशिलाप्रवालाश्मगर्भमुसारगल्वलोहितमुक्तादीनां कृतनिधीनां स पोतस्तेषां कालिकावातेन राक्षसीद्वीपे क्षिप्तः स्यात्, तस्मिंश्च कश्चिदेवैकः सत्त्वः स्यात् योऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्याक्रन्दं कुर्यात्, सर्वे ते परिमुच्येरंस्तस्माद् राक्षसीद्वीपात्। अनेन खलु पुनः कुलपुत्र कारणेन अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽवलोकितेश्वर इति संज्ञायते॥

सचेत् कुलपुत्र कश्चिदेव वध्योत्सृष्टोऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्याक्रन्दं कुर्यात्, तानि तेषां वध्यघातकानां शस्त्राणि विकीर्येरन्। सचेत् खलु पुनः कुलपुत्र अयं त्रिसाहस्रमहासाहस्रो लोकधातुर्यक्षराक्षसैः परिपूर्णो भवेत्, तेऽवलोकितेश्वरस्य महासत्त्वस्य नामधेयग्रहणेन दुष्टचित्ता द्रष्टुमप्यशक्ताः स्युः। सचेत्खलु पुनः कुलपुत्र कश्चिदेव सत्त्वो दार्वायस्मयैर्हडिनिगडबन्धनैर्बद्धो भवेत्, अपराध्यनपराधी वा, तस्यावलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधेयग्रहणेन क्षिप्रं तानि हडिनिगडबन्धनानि विवरमनुप्रयच्छन्ति। ईदृशः कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य प्रभावः॥

सचेत्कुलपुत्र अयं त्रिसाहस्रमहासाहस्रो लोकधातुर्धूर्तैरमित्रैश्चौरैश्च शस्त्रपाणिभिः परिपूर्णो भवेत्, तस्मिंश्चैकः सार्थवाहो महान्तं सार्थं रत्नाढ्यमनर्ध्यं गृहीत्वा गच्छेत्। ते गच्छन्तस्तांश्चौरान् धूर्तान् शत्रूंश्च शस्त्रहस्तान् पश्येयुः। दृष्ट्वा च पुनर्भीतास्त्रस्ता अशरणमात्मानं संजानीयुः। स च सार्थवाहस्तं सार्थमेवं ब्रूयात्-मा भैष्ट कुलपुत्राः, मा भैष्ट, अभयंददमवलोकितेश्वरं बोधिसत्त्वं महासत्त्वमेकस्वरेण सर्वे समाक्रन्दध्वम्। ततो यूयमस्माच्चौरभयादमित्रभयात् क्षिप्रमेव परिमोक्ष्यध्वे। अथ खलु सर्व एव स सार्थः एकस्वरेण अवलोकितेश्वरमाक्रन्देत्-नमो नमस्तस्मै अभयंददायावलोकितेश्वराय बोधिसत्त्वाय महासत्त्वायेति॥ सहनामग्रहणेनैव स सार्थः सर्वभयेभ्यः परिमुक्तो भवेत्। ईदृशः कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य प्रभावः॥

ये कुलपुत्र रागचरिताः सत्त्वाः, तेऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कृत्वा विगतरागा भवन्ति। ये द्वेषचरिताः सत्त्वाः, तेऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कृत्वा विगतद्वेषा भवन्ति। ये मोहचरिताः सत्त्वाः, तेऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कृत्वा विगतमोहा भवन्ति। एवं महर्द्धिकः कुलपुत्र अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः॥

यश्च कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य पुत्रकामो मातृग्रामो नमस्कारं करोति, तस्य पुत्रः प्रजायते अभिरूपः प्रासादिको दर्शनीयः। पुत्रलक्षणसमन्वागतो बहुजनप्रियो मनापोऽवरोपितकुशलमूलश्च भवति। यो दारिकामभिनन्दति, तस्य दारिका प्रजायते अभिरूपा प्रासादिका दर्शनीया परमया शुभवर्णपुष्करतया समन्वागता दारिका-लक्षणसमन्वागता बहुजनप्रिया मनापा अवरोपितकुशलभूला च भवति। ईदृशः कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य प्रभावः॥

ये च कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं करिष्यन्ति, नामधेयं च धारयिष्यन्ति, तेषाममोघफलं भवति। यश्च कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं करिष्यति, नामधेयं च धारयिष्यति, यश्च द्वाषष्टीनां गङ्गानदीवालिकासमानां बुद्धानां भगवतां नमस्कारं कुर्यात्, नामधेयानि च धारयेत्, यश्च तावतामेव बुद्धानां भगवतां तिष्ठतां ध्रियतां यापयतां चीवरपिण्डपातशयनासनग्लानप्रत्ययभैषज्यपरिष्कारैः पूजां कुर्यात्, तत्किं मन्यसे कुलपुत्र कियन्तं स कुलपुत्रो वा कुलदुहिता वा ततोनिदानं पुण्याभिसंस्कारं प्रसवेत्? एवमुक्ते अक्षयमतिर्बोधिसत्त्वो महासत्त्वो भगवन्तमेतदवोचत्-बहु भगवन्, बहु सुगत स कुलपुत्रो वा कुलदुहिता वा ततोनिदानं बहुं पुण्याभिसंस्कारं प्रसवेत्। भगवानाह-यश्च कुलपुत्र तावतां बुद्धानां भगवतां सत्कारं कृत्वा पुण्याभिसंस्कारः, यश्च अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य अन्तश एकमपि नमस्कारं कुर्यात् नामधेयं च धारयेत्, समोऽनधिकोऽनतिरेकः पुण्याभिसंस्कारः उभयतो भवेत्। यश्च तेषां द्वाषष्टीनां गङ्गानदीवालिकासमानां बुद्धानां भगवतां सत्कारं कुर्यात् नामधेयानि च धारयेत्, यश्च अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नमस्कारं कुर्यात् नामधेयं च धारयेत्, एतावुभौ पुण्यस्कन्धौ न सुकरौ क्षपयितुं कल्पकोटीनयुतशतसहस्रैरपि। एवमप्रमेयं कुलपुत्र अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य नामधारणात् पुण्यम्॥

अथ खल्वक्षयमतिर्बोधिसत्त्वो महासत्त्वो भगवन्तमेतदवोचत्-कथं भगवन् अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽस्यां सहायां लोकधातौ प्रविचरति? कथं सत्त्वानां धर्मं देशयति? कीदृशश्चावलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्योपायकौशल्यविषयः? एवमुक्ते भगवानक्षयमतिं बोधिसत्त्वं महासत्त्वमेतदवोचत्-सन्ति कुलपुत्र लोकधातवः येष्ववलोकितेश्वरो बोधिसत्त्वो महासत्त्वो बुद्धरूपेण सत्त्वानां धर्मं देशयति। सन्ति लोकधातवः, येष्ववलोकितेश्वरो बोधिसत्त्वो महासत्त्वो बोधिसत्त्वरूपेण सत्त्वानां धर्मं देशयति। केषांचित् प्रत्येकबुद्धरूपेण अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिच्छ्रावकरूपेण अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिद् ब्रह्मरूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिच्छक्र‍रूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः धर्मं देशयति॥ केषांचिद् गन्धर्वरूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। केषांचिद् गन्धर्वरूपेणावलोकितेश्वरो बोधिसत्त्वो महासत्त्वः सत्त्वानां धर्मं देशयति। यक्षवैनेयानां सत्त्वानां यक्षरूपेण धर्मं देशयति। ईश्वरवैनेयानां सत्त्वानामीश्वररूपेण, महेश्वरवैनेयानां सत्त्वानां महेश्वररूपेण धर्मं देशयति। चक्रवर्तिराजवैनेयानां सत्त्वानां चक्रवर्तिराजरूपेण धर्मं देशयति। पिशाचवैनेयानां सत्त्वानां पिशाचरूपेण धर्मं देशयति। वैश्रवणवैनेयानां सत्त्वानां वैश्रवणरूपेण धर्मं देशयति।

सेनापतिवैनेयानां सत्त्वानां सेनापतिरूपेण धर्मं देशयति। ब्राह्मणवैनेयानां सत्त्वानां ब्राह्मणरूपेण धर्मं देशयति। वज्रपाणिवैनेयानां सत्त्वानां वज्रपाणिरूपेण धर्मं देशयति। एवमचिन्त्यगुणसमन्वागतः कुलपुत्र अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वः। तस्मात्तर्हि कुलपुत्र अवलोकितेश्वरं बोधिसत्त्वं महासत्त्वं पूजयध्वम्। एष कुलपुत्र अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वो भीतानां सत्त्वानामभयं ददाति। अनेन कारणेन अभयंदद इति संज्ञायते इह सहायां लोकधातौ॥

अथ खल्वक्षयमतिर्बोधिसत्त्वो महासत्त्वो भगवन्तमेतदवोचत्-दास्यामो वयं भगवन् अवलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय धर्मप्राभृतं धर्माच्छादम्। भगवानाहयस्येदानीं कुलपुत्र कालं मन्यसे। अथ खल्वक्षयमतिर्बोधसत्त्वो महासत्त्वः स्वकण्ठादवर्ताय शतसहस्रमूल्यं मुक्ताहारमवलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय धर्माच्छादमनुप्रयच्छति स्म-प्रतीच्छ सत्पुरुष इमं धर्माच्छादं ममान्तिकात्। स न प्रतीच्छति स्म। अथ खल्वक्षयमतिर्बोधिसत्त्वो महासत्त्वोऽवलोकितेश्वरं बोधिसत्त्वं महासत्त्वमेतदवोचत्-प्रतिगृहाण त्वं कुलपुत्र इमं मुक्ताहारमस्माकमनुकम्पामुपादाय। अथ खल्ववलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽक्षयमतेर्बोधिसत्त्वस्य महासत्त्वस्यान्तिकात् तं मुक्ताहारं प्रतिगृह्णाति स्म अक्षयमतेर्बोधिसत्त्वस्य महसत्त्वस्यानुकम्पामुपादाय, तासां च चतसृणां पर्षदां तेषां च देवनागयक्षगन्धर्वासुरगरूडकिन्नरमहोरगमनुष्यामनुष्याणामनुकम्पामुपादाय। प्रतिगृह्य च द्वौ प्रत्यंशौ कृतवान्। कृत्वा चैकं प्रत्यंशं भगवते शाक्यमुनये ददाति स्म, द्वितीयं प्रत्यंशं भगवतः प्रभूतरत्नस्य तथागतस्यार्हतः सम्यक्संबुद्धस्य रत्नस्तूपे समुपनामयायास। ईदृश्या कुलपुत्र विकुर्वया अवलोकितेश्वरो बोधिसत्त्वो महासत्त्वोऽस्यां सहायां लोकधातावनुविचरति॥

अथ खलु भगवांस्तस्यां वेलायामिमा गाथा अभाषत—

चित्रध्वज अक्षयोमती
एतमर्थं परिपृच्छि कारणात्॥
केना जिनपुत्र हेतुना
उच्यते हि अवलोकितेश्वरः॥१॥

अथ स दिशता विलोकिया
प्रणिधीसागरु अक्षयोमति।
चित्रध्वजोऽध्यभाषत
शृणु चर्यामवलोकितेश्वरे॥२॥

कल्पशत नेककोट्यचिन्तिया
बहुबुद्धान सहस्रकोटिभिः।
प्रणिधान यथा विशोधितं
स्तथ शृण्वाहि मम प्रदेशतः॥३॥

श्रवणो अथ दर्शनोऽपि च
अनुपूर्वं च तथा अनुस्मृतिः।
भवतीह अमोघ प्राणिनां
सर्वदुःखभवशोकनाशकः॥४॥

सचि अग्निखदाय पातयेद्
घतनार्थाय प्रदुष्टमानसः।
स्मरतो अवलोकितेश्वरं
अभिसिक्तो इव अग्नि शाम्यति॥५॥

सचि सागरदुर्गि पातये-
न्नागमकरसुरभूतआलये।
स्मरतो अवलोकितेश्वरं
जलराजे न कदाचिसीदति॥६॥

सचि मेरुतलातु पातयेद्
घतनार्थाय प्रदुष्टमानसः।
स्मरतो अवलोकितेश्वरं
सूर्यभूतो व नभे प्रतिष्ठति॥७॥

वज्रामय पर्वतो यदि
घतनार्थाय हि मूर्ध्नि ओषरेत्।
स्मरतो अवलोकितेश्वरं
रोमकूप न प्रभोन्ति हिंसितुम्॥८॥

सचि शत्रुगणैः परीवृतः
शस्त्रहस्तैर्विहिंसचेतसैः।
स्मरतो अवलोकितेश्वरं
मैत्रचित्त तद भोन्ति तत्क्षणम्॥९॥

सचि आघतने उपस्थितो
वध्यघातनवशंगतो भवेत्।
स्मरतो अवलोकितेश्वरं
खण्डखण्ड तद शस्त्र गच्छियुः॥१०॥

सचि दारुमयैरयोमयै-
र्हडिनिगडैरिह बद्धबन्धनैः।
स्मरतो अवलोकितेश्वरं
क्षिप्रमेव विपटन्ति बन्धना॥११॥

मन्त्रा बल विद्य ओषधी
भूत वेताल शरीरनाशका।
स्मरतो अवलोकितेश्वरं
तान् गच्छन्ति यतः प्रवर्तिताः॥१२॥

सचि ओजहरैः परीवृतो
नागयक्षसुरभूतराक्षसैः।
स्मरतो अवलोकितेश्वरं
रोमकूप न प्रभोन्ति हिंसितुम्॥१३॥

सचि व्यालमृगैः परीवृत-
स्तीक्ष्णदंष्ट्रनखरैर्महाभयैः।
स्मरतो अवलोकितेश्वरं
क्षिप्र गच्छन्ति दिशा अनन्ततः॥१४॥

सचि दृष्टिविषैः परीवृतो
ज्वलनार्चिशिखिदुष्टदारुणैः।
स्मरतो अवलोकितेश्वरं
क्षिप्रमेव ते भोन्ति निर्विषाः॥१५॥

गम्भीर सविद्यु निश्चरी
मेघवज्राशनि वारिप्रस्रवाः।
स्मरतो अवलोकितेश्वरं
क्षिप्रमेव प्रशमन्ति तत्क्षणम्॥१६॥

बहुदुःखशतैरुपद्रुतान्
सत्त्व दृष्ट्व बहुदुःखपीडितान्।
शुभज्ञानबलो विलोकिया
तेन त्रातरु गजे सदेवके॥१७॥

ऋद्धीबलपारमिंगतो
विपुलज्ञान उपायशिक्षितः।
सर्वत्र दशद्दिशी जगे
सर्वक्षेत्रेषु अशेष दृश्यते॥१८॥

ये च अक्षणदुर्गती भया
नरकतिर्यग्यमस्य शासने।
जातीजरव्याधिपीडिता
अनुपूर्वं प्रशमन्ति प्राणिनाम्॥१९॥

अथ खलु अक्षमतिर्हृष्टतुष्टमना इमा गाथा अभाषत—

शुभलोचन मैत्रलोचना
प्रज्ञाज्ञानविशिष्टलोचना।
कृपलोचन शुद्धलोचना
प्रेमणीय सुमुखा सुलोचना॥२०॥

अमलामलनिर्मलप्रभा
वितिमिर ज्ञानदिवाकरप्रभा।
अपहृतानिलज्वलप्रभा
प्रतपन्तो जगती विरोचसे॥२१॥

कृपसद्गुणमैत्रगर्जिता
शुभगुण मैत्रमना महाघना।
क्लेशाग्नि शमेसि प्राणिनां
धर्मवर्षं अमृतं प्रवर्षसि॥२२॥

कलहे च विवादविग्रहे
नरसंग्रामगते महाभये।
स्मरतो अवलोकितेश्वरं
प्रशमेया अरिसंघ पापका॥२३॥

मेघस्वर दुन्दुभिस्वरो
जलधरगर्जित ब्रह्मसुस्वरः।
स्वरमण्डलपारमिंगतः
स्मरणीयो अवलोकितेश्वरः॥२४॥

स्मरथा स्मरथा स काङ्क्षथा
शुद्धसत्त्वं अवलोकितेश्वरम्।
मरणे व्यसने उपद्रवे
त्राणु भोति शरणं परायणम्॥२५॥

सर्वगुणस्य पारमिंगतः
सर्वसत्त्वकृपमैत्रलोचनो।
गुणभूत महागुणोदधी
वन्दनीयो अवलोकितेश्वरः॥२६॥

योऽसौ अनुकम्पको जगे
बुद्ध भेष्यति अनागतेऽध्वनि।
सर्वदुःखभयशोकनाशकं
प्रणमामी अवलोकितेश्वरम्॥२७॥

लोकेश्वर राजनायको
भिक्षुधर्माकरु लोकपूजितो।
बहुकल्पशतांश्चरित्व च
प्राप्तु बोधि विरजां अनुत्तराम्॥२८॥

स्थित दक्षिणवामतस्तथा
वीजयन्त अमिताभनायकम्।
मायोपमता समाधिना
सर्वक्षेत्रे जिन गत्व पूजिषु॥२९॥

दिशि पश्चिमतः सुखाकरा
लोकधातु विरजा सुखावती।
यत्र एष अमिताभनायकः
संप्रति तिष्ठति सत्त्वसारथिः॥३०॥

न च इस्त्रिण तत्र संभवो
नापि च मैथुनधर्म सर्वशः।
उपपादुक ते जिनोरसाः
पद्मगर्भेषु निषण्ण निर्मलाः॥३१॥

सो चैव अमिताभनायकः
पद्मगर्भे विरजे मनोरमे।
सिंहासनि संनिषण्णको
शालरजो व यथा विराजते॥३२॥

सोऽपि तथा लोकनायको
यस्य नास्ति त्रिभवेस्मि सादृशः।
यन्मे पुण्य स्तवित्व संचितं
क्षिप्र भोमि यथ त्वं नरोत्तम॥३३॥ इति॥

अथ खलु धरणिंधरो बोधिसत्त्वो महासत्त्व उत्थायासनादेकांसमुत्तरासङ्गं कृत्वा दक्षिणं जानुमण्डलं पृथिव्यां प्रतिष्ठाप्य येन भगवांस्तेनाञ्जलिं प्रणाम्य भगवन्तमेतदवोचत्-न ते भगवन् सत्त्वाः अवरकेण कुशलमूलेन समन्वागता भविष्यन्ति, येऽवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्येमं धर्मपर्यायपरिवर्तं श्रोष्यन्ति अवलोकितेश्वरस्य बोधिसत्त्वस्य महासत्त्वस्य विकुर्वानिर्देशं समन्तमुखपरिवर्तं नाम अवलोकितेश्वरस्य बोधिसत्त्वस्य विकुर्वणप्रातिहार्यम्॥

अस्मिन् खलु पुनः समन्तमुखपरिवर्ते भगवता निर्देश्यमाने तस्याः पर्षदश्चतुरशीतिनां प्राणिसहस्राणामसमसमायामनुत्तरायां सम्यक्संबोधौ चित्तान्युत्पन्नान्यभूवन्॥

इति श्रीसद्धर्मपुण्डरीके धर्मपर्याये समन्तमुखपरिवर्तो नामावलोकितेश्वर-

विकुर्वणनिर्देशश्चतुर्विशतिमः॥
</div>

<hr/>
Text extracted from <a href='http://www.dsbcproject.org/canon-text/content/441/2089'> DSBC </a>
`,
        'nilakantha': `<h5> नीलकण्ठ धारणी </h5>
<div>
नमो रत्नत्रयाय । नम आर्यावलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय महाकारुणिकाय सर्वबन्धनच्छेदनकराय सर्वभवसमुद्रशोषणकराय सर्वव्याधिप्रशमनकराय सर्वेत्युपद्रवविनाशनकराय सर्वभयेषु त्राणकराय ।

तस्मै नमस्कृत्वा इमं आर्यावलोकितेश्वरभाषितं नीलकण्ठनाम ।

हृदयं वर्तयिष्यामि सर्वार्थसाधकं शुभम् ।
अजेयं सर्वभूतानां भवमार्गविशोधकम् ॥

तद्यथा । ॐ आलोक ए आलोकमति लोकातिक्रान्त एहि हरे आर्यावलोकितेश्वर महाबोधिसत्त्व । हे बोधिसत्त्व हे महाबोधिसत्त्व हे वीर्यबोधिसत्त्व हे महाकारुणिक स्मर हृदयम् । एह्येहि हरे आर्यावलोकितेश्वर महेश्वर परमार्थचित्त महाकारुणिक । कुरुकुरु कर्म । साधयसाधय विद्याम् । देहिदेहि त्वरं कामम् गम विहङ्गम विगम सिद्धयोगेश्वर । धुरुधुरु वियन्त ए महावियन्त ए । धरधर धरेन्द्रेश्वर । चलचल विमलामल आर्यावलोकितेश्वर जिन । कृष्णजटामकुटाऽवरम प्ररम विरम महासिद्धविद्याधर । बलबल महाबल मल्लमल्ल महामल्ल चल चल महाचल । कृष्णवर्ण दीर्घकृष्णपक्षनिर्घातन हे पद्महस्त । चर चर निशाचरेश्वर कृष्णसर्पकृतयज्ञोपवीत । एह्येहि महावराहमुख त्रिपुरदहनेश्वर नारायणबलोपबलवेशधर । हे नीलकण्ठ हे महाकाल हलाहलविष निर्जित लोकस्य रागविष विनाशन द्वेषविषविनाशन मोहविषविनाशन हुलुहुलु मल्ल । हुलु हरे महापद्मनाभ । सरसर सिरिसिरि सुरुसुरु मुरुमुरु बुध्यबुध्य बोधयबोधय मैत्रिय नीलकण्ठ । एह्येहि वामस्थितसिंहमुख । हसहस मुञ्चमुञ्च महाट्टहासम् । एह्येहि भो महासिद्धयोगेश्वर । भणभण वाचम् । साधयसाधय विद्याम् । स्मरस्मर तं भगवन्तं लोकितविलोकितं लोकेश्वरं तथागतम् । ददाहि मे दर्शनकामस्य दर्शनम् ।

प्रह्लादय मनः स्वाहा ।
सिद्धाय स्वाहा ।
महासिद्धाय स्वाहा ।
सिद्धयोगेश्वराय स्वाहा ।
नीलकण्ठाय स्वाहा ।
वराहमुखाय स्वाहा ।
महानरसिंहमुखाय स्वाहा ।
सिद्धविद्याधराय स्वाहा ।
पद्महस्ताय स्वाहा ।
कृष्णसर्पकृतयज्ञोपवीताय स्वाहा ।
महालकुटधराय स्वाहा ।
चक्रायुधाय स्वाहा ।
शङ्खशब्दनिबोधनाय स्वाहा ।
वामस्कन्धदेशस्थितकृष्णाजिनाय स्वाहा ।
व्याघ्रचर्मनिवसनाय स्वाहा ।
लोकेश्वराय स्वाहा ।
सर्वसिद्धेश्वरय स्वाहा ।

नमो भगवते आर्यावलोकितेश्वराय बोधिसत्त्वाय महासत्त्वाय महाकारुणिकाय ।

सिद्ध्यन्तु मे मन्त्रपदानि स्वाहा ॥
</div>
<hr/>
Text from <a href="https://books.google.de/books?id=0kBSFcX-K4wC&printsec=frontcover&source=gbs_navlinks_s&redir_esc=y&hl=de#v=onepage&q&f=false"> Vajrabodhi's version </a> of Nilakantha Dharani as reconstructed by Lokesh Chandra`,
        'karanda': `<h5> सर्वतथागताधिष्ठानहृदय गुह्यधातु करण्डमुद्रा धारणी </h5>
<div>
नमस्त्र्यध्विकानां सर्वतथागतानां ।
ॐ भुविभवनवरे वचनवचति ।
सुरु सुरु धर धर ।
सर्वतथागतधातु धरे पद्मं भवति ।
जयवरे मुद्रे ।
स्मरतथागतधर्मचक्रप्रवर्तन वज्रे बोधिमण्डालङ्कारालङ्कृते ।
सर्वतथागताधिष्ठिते ।
बोधय बोधय बोधि बोधि बुध्य बुध्य ।
संबोधनि संबोधय ।
चल चल चलन्तु सर्वावरणानि ।
सर्वपापविगते ।
हुरु हुरु सर्वशोकविगते ।
सर्वतथागतहृदयवज्रिणि ।
संभार संभार ।
सर्वतथागतगुह्यधारणी मुद्रे ।
भूते सुभूते ।
सर्वतथागताधिष्ठितधातु गर्भे स्वाहा ।
समयाधिष्ठिते स्वाहा ।
सर्वतथागतहृदयधातु मुद्रे स्वाहा ।
सुप्रतिष्ठितस्तूपे तथागताधिष्ठिते हुरु हुरु हूं हूं स्वाहा ।
ॐ सर्वतथागतोष्णीषधातु मुद्राणि सर्वतथागतसधातु विभूषिताधिष्ठिते हूं हूं स्वाहा ॥
</div>
<hr/>
Text extracted from <a href="http://www.visiblemantra.org/karandamudra.html"> Visible Mantra </a>`,
        'ushnisha': `<h5>उष्णीष विजय धारणी</h5>
<div>
ॐ नमो भगवते सर्वत्रैलोक्य प्रतिविशिष्टाय बुद्धाय ते नमः ।
तद्यथा ।
ॐ भ्रूं भ्रूं भ्रूं ।
शोधय शोधय । विशोधय विशोधय ।
असम समन्त अवभासस्फरण गतिगगन स्वभाव विशुद्धे ।
अभिषिञ्चन्तु मां ।
सर्वतथागत सुगत वरवचन अमृत अभिषेकैः ।
महामुद्र मन्त्रपदैः ।
आहर आहर ।
मम आयुः सन्धारणि ।
शोधय शोधय । विशोधय विशोधय ।
गगन स्वभाव विशुद्धे ।
उष्णीष विजय परिशुद्धे ।
सहस्र रश्मि संचोदिते ।
सर्वतथागत अवलोकिनि ।
षट्पारमिता परिपूरणि ।
सर्वतथागत मति दशभूमि प्रतिष्ठिते ।
सर्वतथागत हृदय अधिष्ठान अधिष्ठिते ।
मुद्रे मुद्रे । महामुद्रे ।
वज्रकाय संहरण परिशुद्धे ।
सर्वकर्म आवरण विशुद्धे ।
प्रतिनिवर्तय ।
मम आयुर्विशुद्धे ।
सर्वतथागत समय अधिष्ठान अधिष्ठिते ।
ॐ मुनि मुनि। महामुनि विमुनि विमुनि । महाविमुनि ।
मति मति । महामति । ममति । सुमति।
तथाता भूतकोटि परिशुद्धे ।
विस्फुट बुद्धे शुद्धे ।
हे हे । जय जय । विजय विजय ।
स्मर स्मर । स्फर स्फर । स्फारय स्फारय ।
सर्वबुद्ध अधिष्ठान अधिष्ठिते ।
शुद्धे शुद्धे । बुद्धे बुद्धे ।
वज्रे वज्रे । महावज्रे सुवज्रे ।
वज्र गर्भे । जय गर्भे । विजय गर्भे । वज्रज्वाल गर्भे ।
वज्रे उद्भवे । वज्र संभवे वज्रे वज्रिणि ।
वज्रं भवतु मम शरीरं सर्व सत्त्वानां च काय परिशुद्धिर्भवतु ।
मे सदा सर्वगति परिशुद्धिश्च । सर्वतथागतश्च मां समाश्वासयन्तु ।
बुद्ध्य बुद्ध्य । सिद्ध्य सिद्ध्य ।
बोधय बोधय । विबोधय विबोधय ।
मोचय मोचय । विमोचय विमोचय ।
शोधय शोधय । विशोधय विशोधय ।
समन्तान मोचय मोचय ।
समन्त रश्मि परिशुद्धे ।
सर्व तथागत हृदय अधिष्ठान अधिष्ठिते ।
मुद्रे मुद्रे । महामुद्रे ।
महामुद्रा मन्त्र पदैः स्वाहा ॥

ॐ भ्रूं स्वाहा ।
ॐ अमृत आयुर्ददे स्वाहा ।
</div>`
      }
    }
  },
  watch: {
    '$route' (to, from) {
      this.name = to.params.text
      this.text = '. . .'
      this.renderPage()
    }
  },
  mounted: function () {
    this.renderPage()
  },
  methods: {
    renderPage: function () {
      this.loading = true
      this.text = this.texts[this.name]
      this.loading = false
    }
  }
}
</script>
