# -*- coding: utf-8 -*-

# Script Mapping for Devanagari

VowelMap =  [
    '𑒁',
    '𑒂',
    '𑒃',
    '𑒄',
    '𑒅',
    '𑒆',
    '𑒇',
    '𑒈',
    '𑒉',
    '𑒊',
    '𑒋',
    '𑒌',
    '𑒍',
    '𑒎',
]

SouthVowelMap = [
    '𑒁𑒺',
    '𑒁𑒽',
]

ModernVowelMap = [
    '𑒋ʽ',
    '𑒂ʽ',
]

SinhalaVowelMap = [
    '𑒋ʽ'
]

VowelSignMap =  [
    '𑒰',
    '𑒱',
    '𑒲',
    '𑒳',
    '𑒴',
    '𑒵',
    '𑒶',
    '𑒷',
    '𑒸',
    '𑒹',
    '𑒻',
    '𑒼',
    '𑒾',
]

SouthVowelSignMap = [
    '𑒺',
    '𑒽',
]

ModernVowelSignMap =[
    '𑒹ʽ',
    '𑒰ʽ'
]

SinhalaVowelSignMap = [
    '𑒹ʽ'
]

AyogavahaMap = [
    '𑒿',
    '𑓀',
    '𑓁'
]

ViramaMap =  [
    '𑓂'
]

ConsonantMap =  [
    '𑒏',
    '𑒐',
    '𑒑',
    '𑒒',
    '𑒓',

    '𑒔',
    '𑒕',
    '𑒖',
    '𑒗',
    '𑒘',

    '𑒙',
    '𑒚',
    '𑒛',
    '𑒜',
    '𑒝',

    '𑒞',
    '𑒟',
    '𑒠',
    '𑒡',
    '𑒢',

    '𑒣',
    '𑒤',
    '𑒥',
    '𑒦',
    '𑒧',

    '𑒨',
    '𑒩',
    '𑒪',
    '𑒫',

    '𑒬',
    '𑒭',
    '𑒮',
    '𑒯'
]

SouthConsonantMap = [
    '𑒝𑓃',
    '𑒭𑓃',
    '𑒩ʽ',
    '𑒪𑓃'
]

NuktaConsonantMap =  [
    '𑒏𑓃',
    '𑒐𑓃',
    '𑒑𑓃',
    '𑒖𑓃',
    '𑒛𑓃',
    '𑒜𑓃',
    '𑒤𑓃',
    '𑒨𑓃'
]

SinhalaConsonantMap =[
    '𑒿𑒑ʽ',
    '𑒿𑒖ʽ',
    '𑒿𑒛ʽ',
    '𑒿𑒠ʽ',
    '𑒿𑒥ʽ',
]

NuktaMap = [
    '𑓃'
]

OmMap = [
    '𑓇'
]

SignMap =[
    '𑓄',
    '।',
    '॥'
]

Aytham =[AyogavahaMap[2]+'ʽ']

NumeralMap = [
    '𑓐',
    '𑓑',
    '𑓒',
    '𑓓',
    '𑓔',
    '𑓕',
    '𑓖',
    '𑓗',
    '𑓘',
    '𑓙'
]
